TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
static err_t _tcp_new_ip_type_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_OK;
  msg->pcb = tcp_new_ip_type(msg->new_ip.type);
  return msg->err;
}

static tcp_pcb *_tcp_new_ip_type(u8_t type) {
  tcp_api_call_t msg;
  msg.new_ip.type = type;
  tcpip_api_call(_tcp_new_ip_type_api, (struct tcpip_api_call_data *)&msg);
  return msg.pcb;
}

static err_t _tcp_bind_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = tcp_bind(msg->pcb, msg->bind.addr, msg->bind.port);
  if (msg->err != ERR_OK) {
    tcp_abort(msg->pcb); // forcibly free unbound PCB
  }
  return msg->err;
}

static esp_err_t _tcp_bind(tcp_pcb *pcb, ip_addr_t *addr, uint16_t port) {
  if (!pcb) {
    return ESP_FAIL;
  }
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.bind.addr = addr;
  msg.bind.port = port;
  tcpip_api_call(_tcp_bind_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _tcp_listen_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_OK;
  msg->pcb = tcp_listen_with_backlog(msg->pcb, msg->backlog);
  return msg->err;
}

static tcp_pcb *_tcp_listen_with_backlog(tcp_pcb *pcb, uint8_t backlog) {
  if (!pcb) {
    return NULL;
  }
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.backlog = backlog ? backlog : 0xFF;
  tcpip_api_call(_tcp_listen_api, (struct tcpip_api_call_data *)&msg);
  return msg.pcb;
}

/*
  Async TCP Client
 */

static void _do_discard_client(void *r, AsyncClient *c) {
  delete c;
}

void asynctcp_callback(asynctcp_callback_fn function, void *ctx) {
  lwip_tcp_event_packet_t *e = new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_CALLBACK, nullptr};
  if (!e) {
    log_e("Failed to allocate event packet");
    return;
  }
  e->callback.fn = function;
  e->callback.arg = ctx;

  queue_mutex_guard guard;
  _send_async_event(e);
}

AsyncClient::AsyncClient(tcp_pcb *pcb)
  : _connect_cb(0), _connect_cb_arg(0), _discard_cb(_do_discard_client), _discard_cb_arg(0), _sent_cb(0), _sent_cb_arg(0), _error_cb(0), _error_cb_arg(0), _recv_cb(0),
    _recv_cb_arg(0), _pb_cb(0), _pb_cb_arg(0), _timeout_cb(0), _timeout_cb_arg(0), _poll_cb(0), _poll_cb_arg(0), _ack_pcb(true), _tx_last_packet(0),
    _rx_timeout(0), _rx_last_ack(0), _rx_ack_len(0), _ack_timeout(CONFIG_ASYNC_TCP_MAX_ACK_TIME), _connect_port(0) {
  _pcb = pcb;
  _closed_slot = INVALID_CLOSED_SLOT;
  if (_pcb) {
    _rx_last_packet = millis();
    _bind_tcp_callbacks(_pcb, this);
    if (!_allocate_closed_slot()) {
      _close();
      ASYNC_TCP_CONSOLE("Allocate %u failure", this);
    } else {
      ASYNC_TCP_CONSOLE("Allocate %u  _closed_slot[%d] succeed", this, _closed_slot);
    }
  }
}

AsyncClient::~AsyncClient() {
  ASYNC_TCP_CONSOLE("Deallocate client %u _closed_slot[%d]", this, _closed_slot);
  if (_pcb) {
    ASYNC_TCP_CONSOLE("%u: close", this);
    _close();
  }
  _free_closed_slot();
}

/*
 * Operators
 * */

bool AsyncClient::operator==(const AsyncClient &other) const {
  return _pcb == other._pcb;
}

/*
 * Callback Setters
 * */

void AsyncClient::onConnect(AcConnectHandler cb, void *arg) {
  _connect_cb = cb;
  _connect_cb_arg = arg;
}

void AsyncClient::onDisconnect(AcConnectHandler cb, void *arg) {
  _discard_cb = cb;
  _discard_cb_arg = arg;
  if (!_discard_cb) {
    _discard_cb = _do_discard_client;
  }
}

void AsyncClient::onAck(AcAckHandler cb, void *arg) {
  _sent_cb = cb;
  _sent_cb_arg = arg;
}

void AsyncClient::onError(AcErrorHandler cb, void *arg) {
  _error_cb = cb;
  _error_cb_arg = arg;
}

void AsyncClient::onData(AcDataHandler cb, void *arg) {
  _recv_cb = cb;
  _recv_cb_arg = arg;
}

void AsyncClient::onPacket(AcPacketHandler cb, void *arg) {
  _pb_cb = cb;
  _pb_cb_arg = arg;
}

void AsyncClient::onTimeout(AcTimeoutHandler cb, void *arg) {
  _timeout_cb = cb;
  _timeout_cb_arg = arg;
}

void AsyncClient::onPoll(AcConnectHandler cb, void *arg) {
  _poll_cb = cb;
  _poll_cb_arg = arg;
}

/*
 * Main Public Methods
 * */

bool AsyncClient::connect(ip_addr_t addr, uint16_t port) {
  if (_pcb) {
    log_d("already connected, state %d", _pcb->state);
    return false;
  }
  if (!_start_async_task()) {
    log_e("failed to start task");
    return false;
  }

  ASYNC_TCP_CONSOLE("%u port: %u", this, port);

  if (!_allocate_closed_slot()) {
    log_e("failed to allocate: closed slot full");
    return false;
  }
  
  tcp_pcb *pcb;
  {
    tcp_core_guard tcg;
#if LWIP_IPV4 && LWIP_IPV6
    pcb = _tcp_new_ip_type(addr.type);
#else
    pcb = _tcp_new_ip_type(IPADDR_TYPE_V4);
#endif
    if (!pcb) {
      log_e("pcb == NULL");
      _free_closed_slot();
      return false;
    }
    _tcp_bind_callback(pcb, this);
  }

  esp_err_t err = _tcp_connect(pcb, _closed_slot, &addr, port, AsyncTCP_detail::tcp_connected);
  bool result = (err == ESP_OK);
  if (result) {
    log_e("tcp_connect failed: %d", err);
    _pcb = pcb;
    _allocate_closed_slot(); // update pcb into _pcb_slots[_closed_slot]
  } else {
    _free_closed_slot();
  }
  return result;
}

#ifdef ARDUINO
bool AsyncClient::connect(const IPAddress &ip, uint16_t port) {
  ip_addr_t addr;
#if ESP_IDF_VERSION_MAJOR < 5
#if LWIP_IPV4 && LWIP_IPV6
  // if both IPv4 and IPv6 are enabled, ip_addr_t has a union field and the address type
  addr.u_addr.ip4.addr = ip;
  addr.type = IPADDR_TYPE_V4;
#else
  addr.addr = ip;
#endif
#else
  ip.to_ip_addr_t(&addr);
#endif
  ASYNC_TCP_CONSOLE("%u IP %s, port: %u", this, ip.toString().c_str(), port);
  return connect(addr, port);
}
#endif

#if LWIP_IPV6 && ESP_IDF_VERSION_MAJOR < 5
bool AsyncClient::connect(const IPv6Address &ip, uint16_t port) {
  auto ipaddr = static_cast<const uint32_t *>(ip);
  ip_addr_t addr = IPADDR6_INIT(ipaddr[0], ipaddr[1], ipaddr[2], ipaddr[3]);

  return connect(addr, port);
}
#endif

bool AsyncClient::connect(const char *host, uint16_t port) {
  ip_addr_t addr;

  ASYNC_TCP_CONSOLE("%u host %s, port: %u", this, host, port);

